#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.external.rabbit_01_psp_token_otp: Reading...
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
random_password.webserver_password: Refreshing state... [id=none]
data.onepassword_item.rabbit_01_psp_token: Reading...
random_password.rtmp_password: Refreshing state... [id=none]
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
data.external.rabbit_01_psp_token_otp: Read complete after 1s [id=-]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + test                  = ""

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*